   export default class GameWanFaDesc{
    public static M_HQMJ_desc = "<color=#FC811F><b>一、基本玩法</b></color><color=#BB8A5A><size=22>"+    
    "\n1、牌    数：包含条、筒、万108张、字牌28张共计136张"+
    "\n2、可行操作：可碰杠 "+
    "\n3、庄家选择：第一局房主当庄，之后胡牌者当庄，黄庄不下庄"+
    "\n4、可一炮多响"+
    "\n5、七对不可胡牌"+
    "\n6、过胡不胡，即在能胡牌却不胡牌的时候，若该玩家没有行动前，其他玩家"+
    "再打同样的牌不可胡牌"+
    "\n7、抢杠算自摸</size></color>"+
    "\n\n<color=#FC811F><b>二、特殊规则</b></color><color=#BB8A5A><size=22>  "+
    "\n1、全幺九包分"+
    "\n当玩家碰杠达到三对及以上时且胡牌类型为全幺九，则此时谁点炮由谁来包赔"+
    "其余两家所付的分值（仅在赢倒三家有中出现）"+
    "\n2、清一色包分"+
    "当玩家吃碰杠达到三对及以上时且胡牌类型为清一色，则此时谁点炮由谁来包"+
    "赔其余两家所付的分值（仅在赢倒三家有中出现）</size></color>"+
    "\n\n<color=#FC811F><b>三、名词解释</b></color><color=#BB8A5A><size=22>"+
    "\n谁打谁出分：即仅点炮者付给赢家双倍分数即可"+
    "\n赢倒三家有：即只要有玩家胡牌，其他三位玩家都需要赔付给玩家相应的分数"+
    "\n占庄：即连庄加分，每连一次庄多加1分"+
    "\n带大牌：即胡牌时计算相对应的牌型分（如四归一、冲天、混一色、对对胡、"+
    "清一色、全幺九等）"+
    "\n明杠暗杠：即胡牌时计算明杠以及暗杠的分值"+
    "\n四归一：某种牌有四张且做为一个刻子及与另两张牌构成一个顺子的胡牌（四"+
    "核时，其中2张不能作为将牌）"+
    "\n冲天：某种花色有1-9的顺子（将1-9去掉以后还能组成胡牌类型）"+
    "\n对对胡：手中只有刻子、碰、杠以及一对将牌组成的胡牌"+
    "\n混一色：由一种序数牌和字牌组成的胡牌"+
    "\n清一色：由一种序数牌组成的胡牌"+
    "\n全幺九：即全部由序数牌的1和9以及字牌组成的胡牌</size></color>"+
    "\n\n<color=#FC811F><b>四、分值计算</b></color><color=#BB8A5A><size=22>"+
    "\n平胡：1分"+
    "\n明杠/补杠：1分"+
    "\n暗杠：2分"+
    "\n自摸：X2"+
    "\n四归一：1分"+
    "\n冲天：2分"+
    "\n混一色：3分"+
    "\n对对胡：4分"+
    "\n清一色：5分"+
    "\n全幺九：15分（此牌型不与任何其他牌型叠加）"+
    "\n杠后开花：X4</size></color>";

    /**
     * 比鸡规则
     */
    public static M_BiJi_desc = "<color=#FC811F><b>一、玩法说明</b></color><color=#BB8A5A><size=22>"+
    "\n1、一副牌去掉大小王，共计52张，支持2-5名玩家"+
    "\n2、开局每人发9张牌，玩家需要将九张牌配成头道、中道、尾道三副牌型，"+
    "\n每副三张，且需满足头道＜中道＜尾道。"+
    "\n3、当玩家都点击我已配好之后，所有玩家开始互相比较三道牌型大小，"+
    "\n先比头道，再比中道，最后比尾道，判定每道输赢，结算每道得分，汇总计算每家得分。"+
    "\n4、比牌阶段，玩家可选择弃牌，弃牌的玩家三道牌型默认最后一名，弃牌玩家只输基础分，"+
    "\n不输喜钱，若多个玩家同时弃牌，则按弃牌先后顺序判断名次，最后弃牌的玩家为最后一名。</size></color>"+
    "\n\n<color=#FC811F><b>二、比牌规则</b></color><color=#BB8A5A><size=22>"+
    "\n1、先比较牌型，三条＞同花顺＞同花＞顺子＞对子＞单张(即乌龙)。若牌型相同，则比较点数。"+
    "\n2、点数按大小比较，A＞K＞Q＞J＞10＞9＞8＞7＞6＞5＞4＞3＞2,若点数大小相同，在比较花色。"+
    "\n3、花色大小按照黑桃＞红桃＞梅花＞方块的方式进行比较。"+
    "\n注：炸弹配成1、1、2形式则不算炸弹的喜分，必须组成3、1形式才行"+
    "\n三条配成2、1形式则不算三条的喜分，必须三张在一起的形式才行</size></color>"+
    "\\n<color=#FC811F><b>三、喜分计分规则</b></color><color=#BB8A5A><size=22>"+
    "\n经典玩法:（此为每个人应付喜分）"+
    "\n三青、双顺青、双三条、炸弹、全红、全黑、通关的喜分为(人数-1)X1倍X底分"+
    "\n三顺青、连顺的喜分为(人数-1)X2倍X底分"+
    "\n连顺青、全三条、双炸弹的喜分为(人数-1)X3倍X底分"+
    "\n<b>注：底分即为喜分的倍数</b></size></color>";

   /**
     * 红中麻将
     */
    public static M_LHZMJ_desc = "<color=#FC811F><b>一、基本规则</b></color><color=#BB8A5A><size=22>"+
    "\n1、牌数：包含条、筒、万108张、红中4张共计112张" +
    "\n2、可行操作：可碰杠" +
    "\n3、庄家选择：第一局房主当庄，之后胡牌者当庄，黄庄不下庄" +
    "\n4、七对可胡牌" +
    "\n5、杠了就有" +
    "\n\n<color=#FC811F><b>二、特殊规则</b></color><color=#BB8A5A><size=22>" +
    "\n1、四红中可直接胡牌" +
    "\n2、可抢杠胡（只有在没有红中的情况下抢杠胡），且被抢杠的玩家包三家分（不包括杠分）" +
    "\n多人抢杠胡时，只包第一家三家分，其他家胡牌则按照自家分算即可" +
    "\n3、每局结束时需要扎码（流局则不需要），即每局胡牌后需要根据已选的番码数来进行番码" +
    "\n4、黄庄下庄，直接到下家坐庄" +
    "\n\n<color=#FC811F><b>三、名词解释</b></color><color=#BB8A5A><size=22>" +
    "\n1、素牌：⼿中⽆红中胡牌" +
    "\n2、捧手：门清，胡牌时未碰、未扛时胡牌（可暗杠）" +
    "\n3、打中：把红中打掉后胡牌，也就是素牌时胡牌" +
    "\n4、跑中：可以胡任意⼀张牌" +
    "\n5、杠上开花：杠后摸牌直接胡牌" +
    "\n6、七小对：由其个对子组成的胡牌" +
    "\n7、四中：即集齐四个红中即可胡牌" +
    "\n8、抢杠胡：即在玩家无红中的时候，其他玩家补杠可抢杠胡牌" +
    "\n9、地胡：即在第一圈内闲家起手胡牌或者暗杠以后直接胡牌" +
    "\n10、天胡：即庄家起手胡牌或者暗杠以后直接胡牌" +
    "\n\n<color=#FC811F><b>四、分值计算</b></color><color=#BB8A5A><size=22>" +
    "\n胡牌：2分" +
    "\n明杠：3分（一人赔付）" +
    "\n补杠：1分（每人1分）" +
    "\n暗杠：2分（每人2分）" +
    "\n素牌：2分" +
    "\n打中：5分" +
    "\n跑中：2分" +
    "\n杠上开花：2分" +
    "\n七小对：2分" +
    "\n抢杠胡：5分（不计胡牌2分）" +
    "\n天胡：5分（不计胡牌2分）" +
    "\n地胡：5分（不计胡牌2分）" +
    "\n四中：10分" ;

    /**
     * 快乐拼十
     */
    public static M_NiuNiu_desc =  "<color=#FC811F><b>一、基本规则</b></color><color=#BB8A5A><size=22>" +
    "\n1、牌数：一副牌，去掉两个王，总共52张牌" +
    "\n2、人数：2-6个人玩，每人发5张牌" +
    "\n3、玩法：系统随机发5张牌，玩家可在其中任选三张使其相加是10的倍数即可，其中J、Q、K算10点，然后另外两张相加的点数即为所比较的点数（所加点数大于10 则需要减去10）（五小牛，四炸, 三带二和顺子另算）" +
    
    "\n\n<color=#FC811F><b>二、大小比较</b></color><color=#BB8A5A><size=22>" +
    "\n1、不同牌型比较（从大到小）：五小牛,四炸,五花牛,三带二,顺子,牛牛,牛九,牛八,牛七,牛六,牛五,牛四,牛三,牛二,牛一,没牛" +
    "\n2、相同牌型比较：相同牌型仅比较最大的一张即可，若最大的一张相同，则比较花色" +
    "\n3、最大牌的比较（从大到小）：K,Q,J,10,9,8,7,6,5,4,3,2,A" +
    "\n4、花色的比较（从大到小）：黑桃,红桃,梅花,方块" +
    "\n5、注：四炸比较炸弹的大小;三带二比较三张的大小" +
    
    "\n\n<color=#FC811F><b>三、名词解释</b></color><color=#BB8A5A><size=22>" +
    "\n1、房主坐庄：即第一局房主为庄家（看牌抢庄除外）" +
    "\n2、随机坐庄：即第一局系统会随机选择庄家（看牌抢庄除外）" +
    "\n3、看牌抢庄：游戏开始后，系统会给每位玩家发4张牌，玩家根据自己的牌况决定是否抢庄；玩家最多可以选择4倍额度来抢庄，抢庄额度最高的玩家成为庄家。若存在不止1名玩家用4倍额度抢庄，则由系统随机抽签决定庄家" +
    "\n4、无牛下庄：直到庄家拿到无牛牌后，庄家变为下一家" +
    "\n5、牛九换庄：拿到牛九的玩家下局坐庄（牌型一致时，较大者下局当庄）" +
    
    "\n\n<color=#FC811F><b>四、牌型解释</b></color><color=#BB8A5A><size=22>" +
    "\n1、顺  子：5张连续数字组成的牌型，顺子中只有A 、2 、3 、4 、5；没有 10 、J 、Q 、K 、A" +
    "\n2、三带二：由三张相同数字组成的牌以及另外两张相同数字组成的牌型" +
    "\n3、五花牛：由J、Q、K中任选5张所组成的牌型" +
    "\n4、四  炸：由四张相同数字组成的牌以及另外一张任意牌组成的牌型" +
    "\n5、五小牛：由五张均小于5且所加之和小于等于10的牌组成的牌型" +
    
    "\n\n<color=#FC811F><b>五、分值计算</b></color><color=#BB8A5A><size=22>" +
    "\n1、牛六、牛五、牛四、牛三、牛二、牛一、没牛（1倍）" +
    "\n2、牛七、牛八（2倍）" +
    "\n3、牛九（3倍）" +
    "\n4、牛牛（4倍）" +
    "\n5、顺子、三带二、五花牛（5倍）" +
    "\n6、四炸（6倍）" +
    "\n7、五小牛（7倍）"; 


    /**
     * 明光麻将
     */
    public static M_MGMJ_desc =  "<color=#FC811F><b>一、基本规则</b></color><color=#BB8A5A><size=22>"+
    "\n1、牌数：包含条、筒、万108张以及字牌28张共计136张" +
    "\n2、可行操作：可碰、可杠，不可吃牌，可自摸" +
    "\n3、坐庄选择：第一局房主坐庄，之后轮庄，黄庄不下庄（胡牌或者黄庄不下庄）" +
    "\n4、杠了就有（黄庄不算）" +
    "\n5、七对不能胡" +
    "\n6、无一炮多响" +
    "\n7、过胡不胡" +
    
    "\n\n<color=#FC811F><b>二、特殊规则</b></color><color=#BB8A5A><size=22>" +
    "\n1、白皮百搭" +
    "\n2、白皮可以当任意牌来组合使用" +
    "\n3、百搭牌可碰杠" +
    "\n4、牌局只要形成配子吃，只允许自摸，不允许胡别人的牌，不允许抢杠胡。" +
    "\n5、包牌规则" +
    "牌局形成清一色：如果A玩家打清一色，且之前已碰三次（三抹在地），则再出这色牌放A玩家胡牌的玩家包赔三家分数。如果有玩家放A玩家第四次碰，则不管任何人放A胡都是放第四次碰玩家包赔。包括A自摸，也是第四次放A碰牌的玩家包牌。（三打四包，杠分不包）。自摸胡和点炮胡两种玩法清一色三抹在地都要包牌。自摸胡是放A玩家第四次碰的玩家包A玩家最后自摸清一色的分数。玩家清一色三抹在地，再出这种花色牌的玩家要对此局清一色分值负责包分（包清一色不包混一色，不包混一色碰碰胡）" +
    
    "\n\n<color=#FC811F><b>三、名词解释</b></color><color=#BB8A5A><size=22>" +
    "\n1、配子吃：即全胡牌" +
    "\n2、独一：即仅能胡一张牌" +
    "\n3、四喜：即四个配子，可直接胡牌" +
    "\n4、对对胡：即胡牌时全部以碰杠或以刻子再加上一个将牌组成的牌型" +
    "\n5、混一色：即胡牌时只有一种花色加上字牌组成的牌型" +
    "\n6、清一色：即胡牌时只有一种花色的牌型" +
    "\n7、天胡 ：庄家起手胡牌（可叠加其他牌型）" +
    
    "\n\n<color=#FC811F><b>四、分值计算</b></color><color=#BB8A5A><size=22>" +
    "\n1、自摸：+1分" +
    "\n2、庄：+1分" +
    "\n3、明杠：+3分（只收点杠玩家一人分）" +
    "\n4、补杠：+1分" +
    "\n5、暗杠：+2分" +
    "\n6、抢杠胡：算自摸" +
    "\n7、杠后开花：+2分" +
    "\n8、配子吃：+1分" +
    "\n9、独一：+2分" +
    "\n10、对对胡：+3分" +
    "\n11、混一色：+3分" +
    "\n12、清一色：+4分" +
    "\n13、四喜：+4分" +
    "\n14、天胡：+5分";

    /**
     * 明光麻将
     */
    public static M_JZMJ_desc = "<color=#FC811F><b>一、基本规则</b></color><color=#BB8A5A><size=22>" +
    "\n1、牌数：包含条、筒、万108张、字牌28张共计136张" +
    "\n2、可行操作：可碰杠 " +
    "\n3、庄家选择：第一局房主当庄，之后胡牌者当庄，黄庄不下庄" +
    "\n4、不可一炮多响" +
    "\n5、七对可胡牌" +
    "\n6、过胡不胡，即在能胡牌却不胡牌的时候，若该玩家没有行动前，其他玩家再打同样的牌不可胡牌" +
    "\n7、抢杠算自摸" +
    "\n8、黄庄杠分不计" +
    "\n\n<color=#FC811F><b>二、特殊规则</b></color><color=#BB8A5A><size=22>" +
    "\n带跑嘴（即结算时的额外加分）" +
    "\n十三不靠可胡牌" +

    "\n\n<color=#FC811F><b>三、名词解释</b></color><color=#BB8A5A><size=22>" +
    "\n不跑嘴：牌局开始后，不下跑嘴分" +
    "\n自由跑嘴：每⼀局开始前，4个玩家必须选嘴分" +
    "\n固定跑嘴：第⼀局选择跑嘴后，之后每⼀局都是同样的嘴分" +
    "\n死不靠：即十三不靠的每种花色必须满足147、258、369的牌型（即同种花色必须满足相差等于2）" +
    "\n活不靠：即十三不靠的同种花色必须满足相差大于等于2的牌型" +
    "\n七对：手牌全部是对子，没有碰过和杠过" +
    "\n十三不靠：手中牌的数字相差大于2以及不同字牌组成的胡牌" +

    "\n\n<color=#FC811F><b>四、分值计算</b></color><color=#BB8A5A><size=22>" +
    "\n平胡：1分（点炮者付分）" +
    "\n明杠/补杠：1分" +
    "\n暗杠：2分" +
    "\n抢杠胡：按自摸算（不勾选按点炮算）" +
    "\n自摸：1分" +
    "\n七对：2分" +
    "\n十三不靠：2分" +
    "\n杠后开花：2分";


    /**
     * 蚌埠麻将
     */
    public static M_BBMJ_desc =" <color=#FC811F><b>一、基本规则</b></color><color=#BB8A5A><size=22>"+
    "\n1、牌    数：包含条、筒、万108张、字牌28张共计136张" +
    "\n2、可行操作：可碰杠，却不可吃牌 " +
    "\n3、庄家选择：第一局房主当庄，之后轮庄，黄庄不下庄" +
    "\n4、只计胡牌者杠分" +
    "\n5、不可胡七对" +
    "\n6、过胡不胡，即在能胡牌却不胡牌的时候，若该玩家没有行动前，其他玩家再打同样的牌不可胡牌" +

    "\n\n<color=#FC811F><b>二、特殊规则</b></color><color=#BB8A5A><size=22>" +
    "\n东风令带花:即东南西北中的其中一个（按照庄的方位来定）和中发牌（系统自动补花，且开局按出牌顺序把所有玩家的花都补上）" +
    "\n黄庄标志位打完牌（最后一张如果是花牌则补完直接结束）" +
    "\n无花:" +
    "\n黄庄标志为剩余14张（每杠一次加一张）" +

    "\n\n<color=#FC811F><b>三、名词解释</b></color><color=#BB8A5A><size=22>" +
    "\n东风令带花：即中发白以及东风可以补花" +
    "\n无花：即中发白以及东风只可做普通牌" +
    "\n抢杠胡：只可抢补杠胡牌" +
    "\n一炮多响：即不止一个玩家胡同一张牌" +
    "\n杠后开花：即玩家杠牌之后摸牌后恰好胡牌" +

    "\n\n<color=#FC811F><b>四、分值计算</b></color><color=#BB8A5A><size=22>" +
    "\n点炮：1分（一家出分）" +
    "\n自摸：2分（三家出分）" +
    "\n夹边吊：1分" +
    "\n庄：1分" +
    "\n花：一个1分" +
    "\n明杠/补杠：1分（输家出分）" +
    "\n暗杠：2分（输家出分）" +
    "\n抢杠胡：算自摸（包赔）" +
    "\n杠后开花：X2（所有分值）";


    /**
     * 跑得快
     */
    public static M_PDK_desc =
    "<color=#FC811F><b>一、游戏规则</b></color><color=#BB8A5A><size=22>" +
    "\n1、牌数：一副扑克牌根据规则去掉指定牌" +
    "\n2、点数大小：2＞A＞K＞Q＞J＞10＞9＞8＞7＞6＞5＞4＞3" +
    "\n3、牌型：单张、对子、三张、连对、飞机、顺子、三带一/二、四带二、炸弹" +
    "\n4、大小比较" +
    "\na.炸弹大于其他各个牌型，炸弹之间则按照点数比较大小" +
    "\nb.其余牌型不能互压" +
    "\nc.同种牌型则需要出牌数量相同按照最大牌的点数来确定大小（最大牌的点数为点数相同且牌数最多的为准，如三带二，要以三张的大小来比较）" +
    "\n5、在剩余一张时需要报警" +
    "\n6、AAA为炸弹且可带一张单牌作为炸弹" +
    "\n7、炸弹相互管上时小的炸弹作废" +
    "\n注：在15张玩法中，KKK不为炸弹" +
    "\n\n <color=#FC811F><b>二、名词解释</b></color><color=#BB8A5A><size=22>" +
    "\n人数" +
    "\n4人：即在玩法选项中显示13张牌玩法" +
    "\n3人：在玩法选项中显示16张玩法、15张玩法" +
    "\n2人：在玩法选项中显示16张玩法、15张玩法（即相当于3人玩法中有一人弃牌）" +
    "\n玩法" +
    "\n16张玩法：即一副扑克牌去掉大小王、三张二、一张A后所剩余的牌" +
    "\n15张玩法：即一副扑克牌去掉大小王、三张二、三张A一张K后所剩余的牌" +
    "\n13张玩法：即一副扑克牌去掉大小王" +
    "\n规则" +
    "\n有牌必要：即能够压住上家牌就必须打出牌" +
    "\n可不要：即在能够压住上家牌的时候可根据玩家意愿选择是否出牌" +
    "\n有2必打A：为可选项，勾选“有牌必要”时则直接将此隐藏，勾选“可不要”时显示出来供玩家选择（此时在其他玩家打出A时，若有玩家有2则必须打出）" +
    "\n出牌" +
    "\n黑/红桃3：即有黑/红桃3的玩家先出牌，2人时若两家都没有黑/红桃3，则直接按黑/红桃4，并以此类推" +
    "\n黑/红桃3必出：为可选项，勾中即为此玩家第一手牌必须带有黑/红桃3" +
    "\n可选" +
    "\n炸弹+10：勾选则玩家出炸弹就直接+10分（立马结算）" +
    "\n放走包赔：在已知玩家牌的情况下（2张及以下）要出自己手中最大的牌，否则放走下家则需要包赔自己和另一玩家的分值" +
    "\n抓鸟（红桃10）：即有红桃10的玩家多输赢2/5/10/一倍" +
    "\n剩三张甩尾：剩最后三张且点数一样时，其他玩家打出三带一/二且能压住时可直接打出取胜" +

    "\n\n <color=#FC811F><b>三、游戏术语</b></color><color=#BB8A5A><size=22>" +
    "\n单张：即手中的任意一张牌" +
    "\n对子：两张点数相同的牌" +
    "\n三张：三张点数相同的牌（不包含AAA）" +
    "\n连对：两张或以上对子且相连组成的牌型" +
    "\n顺子：5张或以上单张且相连组成的牌型" +
    "\n三带一/二：三张点数相同的牌可以带一/二张牌打出（二张牌可以没有任何关联）" +
    "\n飞机：即两个或以上三张点数相同且相连组成的牌型（可带四张牌（这四张牌可以没有任何关联））" +
    "\n四带二：即四张相同点数的牌可以带两张没有任何关联的牌" +
    "\n炸弹：即四张相同点数的牌或者是AAA带一" +

    "\n\n<color=#FC811F><b>四、分值计算</b></color><color=#BB8A5A><size=22>" +
    "\n一张牌1分（剩余一张不计分）" +
    "\n炸弹：10分（仅在勾选“炸弹+10”时存在）" +
    "\n抓鸟：张数X2/+2/5/10（根据选项来判断）" +
    "\n焖锅：张数X2" ;


  }
   